# -*- coding: utf-8 -*- 

#the stock I have (dictionary)
#数组索引：class mn(IntEnum)
#   股票代码 买入价 买入量 买入时间  
#  'sh600415':[6.83, 1000, 20160120]
inHandStock = {
		'sh600415':[6.83, 1000, '20160120'],
		'sz002230':[28.98, 2000, '20160118']
		}
		
# 股票代码 : 报警状态  当前价        名称
#    xxx   :  [0,       0,            ' ']
monitorStates = {}
		
#the stock pay attention
candidateStock = ['sh000001',
		'sz399001',
		 'sz399006',
		 ' ',
		 'sz002139', 
#		'sh600028', 
		 'sh600121',
		 'sz000878',
		 'sh601117',
#		'sh600565',
		 ' ',
#		'sh600219',
#		'sz002230', 
#		'sh600982', 
#葛洲坝
#		 'sh600068',
#小商品城
		'sh600415', 
		 'sz000778',
#		'sz000895',
		'sh600033',
		 ' ',

#		 'sh601633',
		 'sh600026',
#		 'sz000657',
		 'sh600585',
		 'sz002230'
		]

